In [3]:
import pandas as pd 


se = pd.Series(range(10))
se

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [7]:
se = pd.Series(range(1, 10, 2))
se

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [9]:
se.index = ['a', 'b', 'c', 'd', 'e']

In [10]:
se

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [16]:
se[se > 3]

c    5
d    7
e    9
dtype: int64

In [17]:
se > 3

a    False
b    False
c     True
d     True
e     True
dtype: bool

In [18]:
se * 3

a     3
b     9
c    15
d    21
e    27
dtype: int64

In [19]:
'b' in se

True

In [22]:
se2 = pd.Series({"as":"AS23576 NBP","city":"Seongnam-si (Buljeong-ro)","country":"Republic of Korea","countryCode":"KR","isp":"NBP","lat":37.3638,"lon":127.122,"org":"NBP","query":"125.209.222.142","region":"","regionName":"Gyeonggi-do","status":"success","timezone":"Asia/Seoul","zip":"13561"})
# http://ip-api.com/json/naver.com
se2

as                           AS23576 NBP
city           Seongnam-si (Buljeong-ro)
country                Republic of Korea
countryCode                           KR
isp                                  NBP
lat                              37.3638
lon                              127.122
org                                  NBP
query                    125.209.222.142
region
regionName                   Gyeonggi-do
status                           success
timezone                      Asia/Seoul
zip                                13561
dtype: object

In [23]:
se2.isnull()

as             False
city           False
country        False
countryCode    False
isp            False
lat            False
lon            False
org            False
query          False
region         False
regionName     False
status         False
timezone       False
zip            False
dtype: bool

In [32]:
#example
se1 = pd.Series(range(16))
se1 = se1 * 2
se1.index = se1 #list(se1)
se1[se1 % 4 == 0] = None
se1

0      NaN
2      2.0
4      NaN
6      6.0
8      NaN
10    10.0
12     NaN
14    14.0
16     NaN
18    18.0
20     NaN
22    22.0
24     NaN
26    26.0
28     NaN
30    30.0
dtype: float64

In [41]:
data = {
    'id' : [1,2,3], 
    'name' : ['Choi', 'Lee', 'Kim'], 
    'age' : [10, 20, 30], 
    'assets' : [150.4, 123.4, 88.88], 
    'job' : ['student', 'CEO', 'Dad']
}

df = pd.DataFrame(data) 
#df = pd.DataFrame(data, columns = [~~~], index = [~~~]) 

df

   id  name  age  assets      job
0   1  Choi   10  150.40  student
1   2   Lee   20  123.40      CEO
2   3   Kim   30   88.88      Dad

In [45]:
df.index = df['id']

df

    id  name  age  assets      job
id
1    1  Choi   10  150.40  student
2    2   Lee   20  123.40      CEO
3    3   Kim   30   88.88      Dad

In [55]:
df.loc[1] 
#df.ix[1] .ix is deprecated.

id                    1
name               Choi
age                  10
assets            150.4
job             student
hobby     reading books
Name: 1, dtype: object

In [54]:
df['hobby'] = 'reading books'
df

    id  name  age  assets      job          hobby
id
1    1  Choi   10  150.40  student  reading books
2    2   Lee   20  123.40      CEO  reading books
3    3   Kim   30   88.88      Dad  reading books

In [57]:
res = {1 : 'Bundang', 2 : 'Seoul', 3: 'Incheon'}
res_se = pd.Series(res)
res_se

1    Bundang
2      Seoul
3    Incheon
dtype: object

In [59]:
df['res'] = res_se
df

    id  name  age  assets      job          hobby      res
id
1    1  Choi   10  150.40  student  reading books  Bundang
2    2   Lee   20  123.40      CEO  reading books    Seoul
3    3   Kim   30   88.88      Dad  reading books  Incheon

In [60]:
del df['id']
df

    name  age  assets      job          hobby      res
id
1   Choi   10  150.40  student  reading books  Bundang
2    Lee   20  123.40      CEO  reading books    Seoul
3    Kim   30   88.88      Dad  reading books  Incheon